let header = `
  <h1>ТСЖ "Благовест"</h1>
  <h1>пгт.Рефтинский</h1>
  <div id="menu1" class="menu1">
      <ul class="menu">
          <li><a href="\index.html">Главная</a></li>
          <li><a href="\pages\news.html">Новости</a></li>
          <li><a href="\pages\info.html">Информация о ТСЖ</a></li>
          <li><a href="\test.html">Тест</a></li>
      </ul>
  </div>`

let podval = `
<div>
  <div></div>
  <div></div>
  <div>ТСЖ "Благовест" пгт.Рефтинский 2022</div>        
</div>`

let x = document.getElementById("header");
x.insertAdjacentHTML('afterbegin', header);

let pod = document.getElementById('podval');
pod.insertAdjacentHTML('afterbegin', podval);

let text = "Что такое современный многоквартирный дом? Это не только место проживания людей разных возрастов, интересов и профессий. МКД – это еще и сложная технологическая и управленческая инфраструктура. Километры электрических кабелей и труб различного сечения, системы газоснабжения, отопления и водоснабжения. Так современное жилое здание выглядит «изнутри». Конечно для обеспечения жизнедеятельности такого объекта необходим коллектив профессионалов. К сожалению МУП «ПТ ЖКХ» Рефтинского, не смотря на огромный штат, с поставленной задачей справляется слабо. Одним из выходов из данной ситуации, является создание ТСЖ. Хотя я могу и заблуждаться, что товарищество собственников жилья – панацея, но для меня это так: например в Финляндии, один из районов города Хельсинки, равный по размеру нашему посёлку, обслуживает частная контора, в которой работают всего пять человек – чем не панацея? Чтобы разговор получился более предметным, мы решили обратились к руководителю ТСЖ «Благовест». В расположенном по адресу Юбилейная 17 доме 90 квартир, общая площадь 4450кв.м. и проживают в нём 165 человек. Более детальную информацию о данном ТСЖ можно увидеть на страницах сайта blagovest.ucoz.com Калмыкова Наталья Геннадьевна любезно ответила на все наши вопросы и показала свои «владения» ТСЖ «Благовест» было создано в 2009 году по инициативе администрации посёлка. В штатном расписании ТСЖ всего четыре человека, для выполнения различных работ, привлекаются сторонние организации, например, сантехническое обслуживание дома выполняет Нефедьев В.С. ОАО «Коммунальная служба». Планировалось, что после создание ТСЖ, согласно федеральной программе, из бюджета будут выделены деньги на кап. ремонт и, благодаря этому, можно будет привести в порядок инфраструктуру дома. К сожалению, по ряду причин деньги не были выделены, но и без этих средств, за прошедшие три года, сотрудники ТСЖ успели сделать многое. А сделано действительно не мало, выполнен капитальный ремонт крыши: работа выполнена современными материалами и по новым технологиям. Утеплены швы на торцах здания, в четырёх подъездах сделаны ремонты, стены украсили нарисованные художником цветы. Что примечательно, стоимость выполнения работ в одном подъезде, всего 15 000 рублей, плюс материалы 6000 рублей. К середине мая все подъезды будут отремонтированы и станут радовать взоры жителей. Огромная работа проделана в подвале дома, если раньше, со слов Натальи Геннадьевны, при взгляде на изношенные коммуникации у неё на глаза наворачивались слёзы, всё было полностью прогнившее, дырки в коллекторах горячего водоснабжения были забиты чёпиками. (одна из старых, демонтированных труб) Теперь подвал не стыдно показать, он сухой, без ужасного запаха, который был раньше, сделано освещение. Заменены канализационные трубы, новые пластиковые коллекторы холодного и горячего водоснабжения. Заменено 100 метров труб отопления, установлен общедомовой прибор ХВС и теплосчётчик (что позволило значительно экономить на тепле), заменены все задвижки, всего и не перечислить, одних только отсечных вентилей установлено 90 штук. Мужчины своими силами и на собственные средства у первых подъездов сделали парковку, аналогичная парковка в ближайшие время будет сделана и у последних подъездов. На освещение лестничных клеток в подъездах были установлены датчики движения, что позволило снизить общедомовые расходы на электроэнергию. Улучшено освещение двора, двор освещается двумя мощными лампами. Двор вполне благоустроен, Наталья Геннадьевна надеется, что в наш посёлок придёт программа 1000 дворов, а это вполне вероятно, потому что администрация посёлка сделала всё необходимое для этого, тогда Юбилейная 17, однозначно, станет лучшим двором посёлка. Ещё один немаловажный момент, это то что в ТСЖ «Благовест» практически нет проблем с неплательщиками, злостных неплательщиков в данном товариществе, можно сказать нет. Чаще люди просто забывают о необходимости оплатить коммунальные услуги, либо им не хватает времени. Если пенсионеры, как правило, оплачиваю сразу после получения квитанций, то работающие жители, могут тянуть до последнего. Что бы этого не происходило, правление ТСЖ старается напоминать собственникам об оплате, при встречах, по телефону. Есть только одна квартира, долг которой около 13 000. Эффективность работы данного ТСЖ налицо, выводы напрашиваются сами собой: либо МУП «ПТ ЖКХ» должно задуматься об улучшении своей работы, либо жителям пора создавать собственные ТСЖ."
let textpage = document.getElementById('text');
textpage.insertAdjacentText('afterbegin', text);